// @flow

export const RESULT: Array<string> = [
  '負け',
  '勝ち',
];

export const MODE: Array<string> = [
  'エリア',
  'ヤグラ',
  'ホコ',
];

export const STAGE: Array<string> = [
  'バッテラストリート',
  'フジツボスポーツクラブ',
  'ガンガゼ野外音楽堂',
  'コンブトラック',
  '海女美術大学',
  'タチウオパーキング',
];

export const RANK: Array<string> = [
  'C-',
  'C',
  'C+',
  'B-',
  'B',
  'B+',
  'A-',
  'A',
  'A+',
  'S',
  'S+',
];

export const LOG_PER_PAGE: number = 20;

export const MODE_COLOR: Array<string> = [
  '#FF7D10',
  '#6770FF',
  '#FDF81E',
];

export const WEAPON: { [string]: string } = {
  'aa1': 'わかばシューター',
  'aa2': 'もみじシューター',
  'ab1': 'スプラシューター',
  'ab2': 'スプラシューターコラボ',
  'ab3': 'ヒーローシューター レプリカ',
  'ab4': 'オクタシューター レプリカ',
  'ab5': 'スプラシューターワサビ',
  'ac1': 'プライムシューター',
  'ac2': 'プライムシューターコラボ',
  'ac3': 'プライムシューターベリー',
  'ad1': '.52ガロン',
  'ad2': '.52ガロンデコ',
  'ad3': '.96ガロン',
  'ad4': '.96ガロンデコ',
  'ae1': 'プロモデラーMG',
  'ae2': 'プロモデラーRG',
  'ae3': 'プロモデラーPG',
  'af1': 'ジェットスイーパー',
  'af2': 'ジェットスイーパーカスタム',
  'af3': 'デュアルスイーパー',
  'af4': 'デュアルスイーパーカスタム',
  'ag1': 'N-ZAP85',
  'ag2': 'N-ZAP89',
  'ag3': 'N-ZAP83',
  'ah1': 'シャープマーカー',
  'ah2': 'シャープマーカーネオ',
  'ah3': 'ボールドマーカー',
  'ah4': 'ボールドマーカーネオ',
  'ah5': 'ボールドマーカー7',
  'ai1': 'L3リールガン',
  'ai2': 'L3リールガンD',
  'ai3': 'H3リールガン',
  'ai4': 'H3リールガンD',
  'ai5': 'H3リールガンチェリー',

  'ba1': 'スプラローラー',
  'ba2': 'スプラローラーコラボ',
  'ba3': 'ヒーローローラー レプリカ',
  'ba4': 'スプラローラーコロコロ',
  'bb1': 'ダイナモローラー',
  'bb2': 'ダイナモローラーテスラ',
  'bb3': 'ダイナモローラーバーンド',
  'bc1': 'カーボンローラー',
  'bc2': 'カーボンローラーデコ',

  'ca1': 'パブロ',
  'ca2': 'パブロ・ヒュー',
  'ca3': 'パーマネント・パブロ',
  'cb1': 'ホクサイ',
  'cb2': 'ホクサイ・ヒュー',

  'da1': 'スプラチャージャー',
  'da2': 'スプラチャージャーワカメ',
  'da3': 'ヒーローチャージャー レプリカ',
  'da4': 'スプラチャージャーベントー',
  'db1': 'スプラスコープ',
  'db2': 'スプラスコープワカメ',
  'db3': 'スプラスコープベントー',
  'dc1': 'リッター3K',
  'dc2': 'リッター3Kカスタム',
  'dd1': '3Kスコープ',
  'dd2': '3Kスコープカスタム',

  'ea1': 'スクイックリンα',
  'ea2': 'スクイックリンβ',
  'ea3': 'スクイックリンγ',

  'fa1': '14式竹筒銃・甲',
  'fa2': '14式竹筒銃・乙',
  'fa3': '14式竹筒銃・丙',

  'ga1': 'ホットブラスター',
  'ga2': 'ホットブラスターカスタム',
  'gb1': 'ロングブラスター',
  'gb2': 'ロングブラスターカスタム',
  'gb3': 'ロングブラスターネクロ',
  'gc1': 'ノヴァブラスター',
  'gc2': 'ノヴァブラスターネオ',
  'gd1': 'ラピッドブラスター',
  'gd2': 'ラピッドブラスターデコ',
  'ge1': 'Rブラスターエリート',
  'ge2': 'Rブラスターエリートデコ',

  'ha1': 'バケットスロッシャー',
  'ha2': 'バケットスロッシャーデコ',
  'ha3': 'バケットスロッシャーソーダ',
  'hb1': 'ヒッセン',
  'hb2': 'ヒッセン・ヒュー',
  'hc1': 'スクリュースロッシャー',
  'hc2': 'スクリュースロッシャーネオ',

  'ia1': 'バレルスピナー',
  'ia2': 'バレルスピナーデコ',
  'ia3': 'バレルスピナーリミックス',
  'ib1': 'スプラスピナー',
  'ib2': 'スプラスピナーコラボ',
  'ib3': 'スプラスピナーリペア',
  'ic1': 'ハイドラント',
  'ic2': 'ハイドラントカスタム',

  'ja1': 'スプラマニューバー',
};
